Revit 2026 API

# RebarBarTypeCreate Method

---

Creates a new RebarBarType object

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static RebarBarType Create(
	Document ADoc
)
```
```vb
Public Shared Function Create (
	ADoc As Document
) As RebarBarType
```
```cpp
public:
static RebarBarType^ Create(
	Document^ ADoc
)
```
```fsharp
static member Create :
        ADoc : Document -> RebarBarType
```

#### Parameters

ADoc Document

#### Return Value

RebarBarType

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

RebarBarType Class

Autodesk.Revit.DB.Structure Namespace